Repository: katajakasa/utuputki
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: Finnish
fi: Suomi

source: English
fi: Englanti

source: Add a new video to the playlist
fi: Lisää uusi video toistolistalle

source: Add
fi: Lisää

source: Given URL is not a valid Youtube video URL.
fi: Annettu URL ei sisällä toimivaa Youtube-videota

source: Given video URL is already once in the playlist with this IP.
fi: Annettu URL on jo kertaalleen toistolistalla tällä IP-osoitteella

source: Video is restricted, and cannot be loaded.
fi: Videon toisto on rajoitettu, eikä sitä siten voida lisätä toistolistalle.

source: Embedding this video is not allowed, and thus cannot be loaded.
fi: Videon embeddaus on estetty, eikä sitä siten voida lisätä toistolistalle.

source: Video is too long. Maximum length for the video is 15 minutes.
fi: Video on liian pitkä. Videon maksimikesto on 15 minuuttia.

source: Unavailable
fi: Ei saatavilla

source: Video does not exist!
fi: Videota ei ole olemassa!

source: Description
fi: Kuvaus

source: Description text for the video
fi: Kuvausteksti videolle

source: URL to a youtube video
fi: URL youtube-videoon

source: Sender IP
fi: Lähettäjän IP

source: Deleted
fi: Poistettu

source: Playing
fi: Toistossa

source: Skip request
fi: Ohituspyyntö

source: Skip requests
fi: Ohituspyynnöt

source: Playback management
fi: Toistonhallinta

source: Currently playing "%(title)s"
fi: Tällä hetkellä toistossa "%(title)s"

source: Vote for skipping this video
fi: Äänestä videon ohittamista

source: There is no video playing currently.
fi: Tällä hetkellä toistettavana ei ole videota.

source: Playlist
fi: Toistolista

source: IP Address
fi: IP-osoite

source: Playlist is empty.
fi: Toistolista on tyhjä

source: Playlist history
fi: Toistohistoria

source: Download playback history in CSV format
fi: Lataa toistohistoria CSV-muodossa

source: No old items.
fi: Ei vanhoja kohteita

source: Language
fi: Kieli

source: Select
fi: Valitse
